#! /bin/bash

###################################################################################

                                #cat：

###################################################################################

# 拼接 Text Through stdin  和 out.txt 的内容
echo "Text Through stdin" | cat - out.txt

# 压缩空白行
cat -s log.txt

# 移除空白行
# tr 将多个连续的换行符连接成一个
cat log.txt | tr -s '\n'

# 标记制表符为 ^ (mac下不可以)
# cat -T out.txt

# 显示行号: 不会修改文件
cat -n out.txt


###################################################################################

       #文件查找与文件列表：find

###################################################################################

# 列出当前目录和子目录的所有文件
find .

# 根据文件名/正则表达式进行搜索
find . -name "*.txt"

# 忽略大小写搜索
find . -iname "tmp*"

# 按照多个条件搜索 -o 代表 or
find . \( -name "*.txt" -o -name "*.pdf" \)

# -name只能按照文件名进行匹配，-path既可以按照文件名匹配，还可以按照路径名匹配
find . -path "*tmp*"

# 按照re匹配
find . -regex "*\(\.py|\.sh\)$"




















