#! /bin/bash

###################################################################################

                            #生成任意大小的文件

###################################################################################

#生成任意大小的文件, if表示input file，of表示output file，bs代表以字节为单位的块大小，count表示块数
dd if=/dev/zero of=junk.data bs=1M count=1


###################################################################################

                            #comm: 求交集和差集,输入必须是排过序的文件

###################################################################################

# 一般用法, 第一列只包含在a.txt中的行，第二列只包含在b.txt中的行，第三列是重复的行
sort a.txt -o a.txt ; sort b.txt -o b.txt
comm a.txt b.txt

# 打印交集，即 删除第一列和第二列
comm a.txt b.txt -1 -2

# 打印两个文件中不相同的行
comm a.txt b.txt -3

# 删除行首的制表符
comm a.txt b.txt -3 | sed 's/^\t//'

# 求差集
comm a.txt b.txt -2 -3


###################################################################################

                            #pushd和popd: 用于在多个目录间进行切换而无需复制粘贴路径

###################################################################################

# 进入目录
# pushd /tmp
# pushd /tmpa

# 回到上级目录
# popd



###################################################################################

                            #wc: 统计行数、单词数、字符数

###################################################################################

# 打印行数
wc -l log.txt

# 打印单词数
wc -w log.txt

# 打印字符数
wc -c log.txt


###################################################################################

                            #tree: 打印目录树, 需要自行安装

###################################################################################

# 一般用法
tree ./

# 同时打印文件和目录大小
tree -h ./