#! /bin/bash

###################################################################################

                            # shell中的特殊变量

###################################################################################

# 特殊变量
echo $0   #当前脚本的文件名
echo $#   #传递给当前脚本的参数个数
echo $*   #传递给当前脚本的所有参数
echo $@   #传递给当前脚本的所有参数,和$*的区别是，当被""包裹时，$*会把所有参数当做一个整体输出，而$@会一个一个输出
echo $?   #上个命令的退出状态
echo $$   #当前shell的进程ID


###################################################################################

                            #df和dh 磁盘

###################################################################################

# 查看某个文件(目录)占用的磁盘空间
du -h log.txt

# 显示磁盘使用占比
du -c log.txt

# 如果指定一个目录，则默认查询的是该目录每个文件的使用情况，如果要查看合计情况  -s
du -sh ./

# 找出目录中最大的10个文件
du -h ./ | sort -nrk 1 | head

# 上面的会输出目录，如果只想包括文件
find . -type f -exec du -h {} \; | sort -nrk 1 | head

# 查看当前可用信息
df -h /





































